{"title": "Oprah Backpedals Race Charge; Doesn't Apologize to Shopgirl", "body": "Tuesday, Oprah Winfrey’snon-apology apologyto Switzerlandreceived all kinds of media attention. What didn’t receive much media attention, though, is the fact that in that same statement, Winfrey backpedaled away from her claim that she had been a victim of racism by a Swiss shopgirl who refused to show her a $38,000 alligator purse. After this shopgirl publiclybranded Winfrey a liar, Winfrey not only said she was “sorry” the incident had “blown up;” the billionaire media mogul alsochanged her story:I guess I did not dress up enough. I did not have anything that said, “I have money.” I didn’t have a diamond stud. I didn’t have a pocketbook. I didn’t have a Louis Vuitton shoe. I just had on a Donna Karan skirt and top and some sandals.This is a completely different story than the one Oprah told bothEntertainment TonightandLarry Kinglast week during a media blitz to publicize her first feature film role in 15 years.Winfrey said absolutely nothing to eitherETor Larry King about being dressed down or not looking like she had money. On the contrary, without qualifiers, or even a hint of the benefit of a doubt, the shopgirl anecdote was relayed to the world as an example of Oprah being a victim of naked racism.The worst part, though, is that during her interview withEntertainment Tonight,Winfrey made it sound as though she was dressed well. The media titan said, “I didn’t have my eyelashes on, but I was in full Oprah Winfrey gear; Donna Karan skirt, sandals.”The phrase “full Oprah Winfrey gear” and the mention of a designer skirt makes it sound as though Winfrey was nicely dressed; the exact opposite of being dressed as though she did not have money.But now that Winfrey’s been calledan out-and-out liar by a sales clerkwho has achieved global racial infamy at the hands of one of the most powerful people in the world, the media titan is quite obviously hoping to make it all go away with a non-apology apology and a rewriting of her own history.The worst part is that the mainstream media is letting Winfrey get away with it.The story yesterday should not have focused on Oprah’s let’s-put-this-to-bed, non-apology apology. If our media were worth anything close to a damn, the story would have been about what it really is: One of the most powerful people in the world hanging some helpless shopgirl out to dry with a specious charge of racism.But, hey, if a sacred cow like Oprah wants this to all go away, our media is going to do what it is told and return to its regularly scheduled programmingof hiringahomophobe like Alec Baldwinwhile destroying Paula Deen over something she said thirty years ago.What the media obviously doesn’t want to face is that none of Oprah’s excuses make a bit of sense. Winfrey claims to be sorry the whole story blew up. But are we supposed to believe someone who made billions in the world of media is now surprised the media would blow up over a charge of racism from one of the most famous people on earth?In her defense, Oprah claims she never identified the store by name. But why would someone like Oprah not do the world a favor and publicly out a store that practices racism? Could it be that Winfrey was worried someone would check up on her story and the whole thing would blow up in her face, like it has?The media’s vanishing act, though, does not change the fact that this whole thing stinks, or that  Winfrey owes this poor shopgirl an apology every bit as public as these false charges of racism, or that Winfrey’s willingness to risk destroying an innocent person’s life is a wicked act.What Winfrey did to this clerk reminds me of those left-wing movies that attack capitalism through the characters of super-wealthy villains who ruin the lives of everyday people for the smallest of stakes.At the conclusion of “Chinatown,” after Jake Gittes (Jack Nicholson) has uncovered and confronted the villain Noah Cross (John Huston), Gittes just can’t comprehend Cross’s motives. Why would someone so wealthy do such terrible things?Gittes:How much are you worth?Cross:I’ve no idea. How much do you want?Gittes:I just want to know what you’re worth. Over ten million?Cross:Oh my, yes!Gittes: Why are you doing it? How much better can you eat? What can you buy that you can’t already afford?That is what I would love to ask Winfrey.If The Great and Powerful Oprah was willing to destroy a helpless woman’s life just to sell more “Butler” tickets or to draw more attention to herself or to up her chances for an Oscar win — why, why are you doing it?You are already a billionaire; how much more money do you need? You are already one of the most famous people in the world; how much more attention do you need? You have been celebrated on a global scale; how much more metal do you need in your trophy room?It seems like a long time ago now, but I remember when Oprah’s brand was all about relating to and lifting up the everyday woman, not steamrolling them on the way to the Oscar podium.Follow  John Nolte on Twitter@NolteNC", "link": "http://www.breitbart.com/Big-Journalism/2013/08/14/Oprah-backpedals-race-charge-doesnt-apologize-to-shopgirl"}