{"title": "Reports: Tea Partiers Heckle Rubio over Amnesty in Orlando", "body": "Sen. Marco Rubio (R-FL) is trying to regain credibility with the conservative base by helping Sens. Ted Cruz (R-FL), Mike Lee (R-UT) and Rand Paul (R-KY) with their effort to defund Obamacare in the upcoming Continuing Resolution (CR), but Tea Party activists are still placing pressure on the junior Senator.“Amid a smattering of boos and yells of ‘no amnesty,’ Sen. Marco Rubio waded through a rowdy summer-recess crowd on Friday where he tried to focus more on the push to defund ObamaCare than the ongoing debate over immigration legislation,”Fox News’ Serafin Gomez reportsfrom Orlando’s Americans for Prosperity Summit.During his remarks, Gomez notes, “Rubio made no mention of immigration legislation that has irked some in the audience–including a group of elderly women from New Mexico who were wearing ‘Pink Slip Rubio’ buttons.”TheWashington Post‘s Matea Goldreportsthat Rubio “did not acknowledge” the heckling crowd and did not directly address immigration legislation before Congress.ThePostquoted a couple Tea Party activists in the crowd disappointed by Rubio’s performance in Washington.“I’d like to see Marco Rubio, just so I can tell him what I think of his positions: He’s on the wrong track of being a conservative,” Rick Barr, an activist from Indianapolis, told Gold.“We’re all a little irritated with Marco,” Judy Peterson, an activist and retired special education teacher, said, according to Gold. “Now, that doesn’t mean we’ve thrown him under the bus. But we would like him to, just come on. He hasn’t explained it very well.”The continued pressure from the conservative base against Rubio comes as Sen. Rand Paul (R-KY), an opponent of the immigration legislation that Rubio shepherded through the Senate,predictedHouse Majority Leader John Boehner will lose his Speakership if he allows the Senate bill or anything like it to become law.“If he allows something to pass out of conference that looks anything like the Senate bill and is passed with a majority of Democrats, I think that will be the final thing he does as speaker,” Paul said on Laura Ingraham’s radio program on Friday. “So, I think he knows that, and I think he’s going to be very cautious, and I hope he will defend us on this and not pass something that looks like the Senate bill.”", "link": "http://www.breitbart.com/Big-Government/2013/08/30/Reports-Tea-Partiers-heckle-Rubio-over-amnesty-in-Orlando"}