{"title": "DOJ Declined Illegal Re-Entry Prosecution of Illegal Immigrant Accused of Serial Rape", "body": "The man now accused in a series of rapes and assaults of women in Austin, Texas, was free on the streets after the U.S. Attorney’s Office in San Antonio declined to prosecute him for illegal re-entry after his fourth deportation.Breitbart Texas learned on Friday that The U.S. Attorney’s Office for the Western District of Texas was asked by agents in Immigration and Customs Enforcement’s (ICE) Enforcement Removal Operations (ERO) to prosecute Nicondemo Coria-Gonzales for illegal re-entry to the U.S. after having previously deported four times. Coria-Gonzales had amassed a criminal record that included three convictions of Driving While Intoxicated.Breitbart Texas spoke on Friday with former Deputy Assistant Secretary/Deputy Director of ICE Alonzo Peña who confirmed that ICE agents requested the prosecution of Coria-Gonzales which would have put him in prison instead of his immediate re-deportation. The U.S. Attorney’s Office declined prosecution leaving ERO agents with no choice but to deport the three-time criminal alien.Coria-Gonzales was deported for the fifth time in July 2015 and returned shortly thereafter to begin his crime spree against women in Austin.Peña expressed frustration with the open border that allows deported criminals to return at will. He said the Coria-Gonzales case shows “just how easy it is to come back across the border. People can move across as freely as they want. That is what really troubles me.”Director Peñacurrently serves as president and founder of DMEP Strategic Consultants, and now provides security services to companies and governments in Mexico and Central America.Breitbart Texas reached out to U.S. Attorney Richard Drubin, Jr., to find out why this prosecution was declined. “In July 2015, this office declined to file charges against Coria-Gonzales for illegal reentry,” Durbin confirmed in a written response to Breitbart Texas’ questions. “Based on the information presented regarding his criminal history at the time, which was incomplete, the office determined that removing him promptly from the United States was the preferable to prosecuting him to secure a relatively short prison sentence.”“ICE in fact removed him within three days,” Durban stated. “We learned additional information about the defendant’s criminal history for the first time today. The decision not to prosecute him at the time was based on an evaluation of the information presented at the time.”Director Peña responded that “ICE did its job.” He said sources within the agency said the DOJ was presented a complete history when ICE asked for prosecution. “If they needed or wanted more information, they would ask for it,” Peña concluded.Unfortunately, the decision not to prosecute the man who had been convicted of crimes in Texas at least three times and had been deported from the U.S. four times left the man free on the streets of Mexico to quickly return and carry out his crimes of rage against women in Austin.The man now stands accused of attacking and sexually assaulting at least 10 women in northeast Austin. Some of the incidents date back to December 2015, a time following several deportations of this alleged criminal.His routine was to pick up women by offering them a ride–or to pick up prostitutes. At least half of the victims were reported to be sex workers, Austin police officials toldKXAN.In July, Coria-Gonzales picked up a 68-year-old woman at a bus stop to “take her to his garden.” The woman, who uses a walking cane, accepted the ride from the man who then drove her to a dirt road where he reportedlybeat her and sexually assaulted her.In another case, Coria-Gonzales attempted toset a woman on fireafter taking her to a secluded road. She said she thought she would soon be dead when he brought out a gas can. The woman was reported to be a prostitute and did not immediately report the crime for fear of being charged as such. He reportedly did not try to have sex with her.Other victims range from age 30 to 60.Coria-Gonzales sits in the Travis County jail and is being held without bond. ICE officials have issued an immigration detainer.In 2015, U.S. Border Patrol agent Hector Garzatestifiedbefore the Texas Senate Subcommittee on Border Security in his role at president of the National Border Patrol Council, Locas 2455. Garza told the Senators that the federal government has some of the “most restrictive prosecutorial guidelines for smuggling cases.” He said that because of this, many cases of human smuggling are not prosecuted. He said these kinds of guidelines also establish prosecutorial discretion for prosecution cases of illegal re-entry by illegal aliens.Breitbart Texas asked the U.S. Attorney’s Office about these thresholds and if that played a factor in the decision not to prosecute Coria-Gonzales. Spokesman Daryl Fields responded “we do not discuss our prosecutorial guidelines or decision-making process.”Bob Priceserves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter@BobPriceBBTX.", "link": "http://www.breitbart.com/texas/2016/09/10/u-s-attorney-declined-illegal-re-entry-prosecution-austin-alleged-serial-rapist/"}