{"title": "Week of Trump Rallies Draws Over 26,000; Hundreds at 2 Clinton Events", "body": "Republican presidential nominee Donald Trump saw many thousands of supporters gather at several rallies this week, far outpacing his opponent, Democratic presidential nominee Hillary Clinton, who again cancelled one of her few campaign events.A conservative estimate of those who attended Trump’s rallies added to those who attended his “America-First” energy plan presentation total over 26,000 for the week. That’s compared to the around 700 that gathered for Clinton events in Philadelphia and Orlando. Those numbers are based on news reports detailed below. Both made stops in Pennsylvania and Florida. Trump held two events in North Carolina and Clinton postponed a fundraiser in that state.Chris Snyder of Fox News tweeted this view of Trump’s Chester Township, Pennsylvania rally on Thursday:Wesley Robinson of PennLive tweeted of the “thousands” gathered for Trump at Sun Center Studios:These posts noted overflow of the crowd in a “big auxiliary room”:Philly.comreportedof the Pennsylvania rally, “At least 3,000 filled the room where Trump gave his speech, with thousands more waiting in an additional overflow room.”Trump also spoke earlier that same day to more than 1,000 gas industry experts in Pittsburg,laying out the detailsof his “America-First” energy plan.Clinton wasn’t scheduled for any campaign rallies on Thursday as noted in a Trump campaign email blast and on awebsitedocumenting Clinton’s campaign schedule.Clinton’s last major event was Wednesday in Orlando, Florida after apparently taking another day off. Clinton postponed a Tuesday fundraiser, “lunch with Hillary Rodham Clinton,”according tolocal WNCN News. The $2,700 to $100,000 event was set to take place at Betty Craven and Michael Warner’s home in Chapel Hill. A Monday night appearance on theTonight Show with Jimmy Fallonhad beenpre-tapedon Friday.The same day as Clinton’s cancelled Tuesday fundraiser, Trump held two North Carolina rallies. One at High Point University drew at least 2,000, a fire official told local Fox8 News reporter Jasmine Spencer around an hour before Trump spoke. The event — held in the university’s 1,750capacityMillis Center — wassold outahead of time. Fox8reportedthat some students shown lined up outside were not able to get into the packed event.Trump posted a thank you to High Point with photos of the event:With a population of fewer than 900 people, Kenansville also hosted Trump for a rally on Tuesday that drew around 10,000 people,according tolocal WNCT News. Around 6,000 of those were able to get in and pack out the Duplin County Event Center. The venue’s website lists expanded seatingcapacityof 6,075.Trump tweeted out photos of the Kenansville rally:Clinton’s Wednesday rally in Orlando brought out “hundreds”according tolocal News13, which reported “as many as 500 people” at the Frontline Outreach Youth and Family Center.Trump’s Wednesday rally in Toledo, Ohio brought out “thousands,”according totheToledo Blade. Don King and Bobby Knightcampaignedwith Trump at the approximately 2,400 capacity Stranahan Theater, which waspacked, and attendees spoke of additional people in an overflow room.Clinton abruptly took several days off, includingcanceling a West Coast fundraising tour, last week after ahealth incidentforced her to leave the ceremony at ground zero, commemorating the 15th year since the Islamic terror attacks on 9/11. She held just a couple of campaign events from Friday through a Mondaycampaign rallyin Philadelphia that drew around 200 attendees at Temple University.Trump, by comparison,packedan event arena with around 8,000 in Estero, Florida on Monday.Both candidates heldFlorida ralliesin early September. Clinton drew around 1,500 on September 6 at the University of South Florida. Trump drew around 12,000 on September 9 in Pensacola, Florida.Trump has another eventscheduledfor Roanoke, Virginia on Saturday evening. Clinton appears to have aclear scheduleahead of Monday night’s debate.Follow Michelle Moons on Twitter@MichelleDiana", "link": "http://www.breitbart.com/2016-presidential-race/2016/09/24/week-of-trump-rallies-draws-over-26000-hundreds-at-2-clinton-events/"}